Repository: britonad/reading-time
Catalog: translations/*/LC_MESSAGES/messages.po
Languages: uk

source: Speed
uk: Швидкість

source: Reading speed. Usually this value is about 200 words per minute.
uk: Швидкість читання. Зазвичай це значення близько 200 слів на хвилину.

source: Paste the URL of the website that should be estimated. Max length is 2083 characters.
uk: Вставте URL адресу яка повинна бути оцінена. Максимальна довжина 2083 символи.

source: Plain text
uk: Звичайний текст

source: Plain text for reading estimation. Max length is 500 000 characters.
uk: Звичайний текст для оцінки читання. Максимальна довжина 5000 000 символів.

source: Text box estimation is next. Words counted: %(len)s. Reading time: ~ %(time)s min
uk: Оцінка текст бокса наступна. Слів пораховано: %(len)s. Час читання: ~ %(time)s хв

source: This link is unreachable.
uk: Посилання недосяжне.

source: URL box estimation is next. Words counted: %(len)s. Reading time: ~ %(time)s min
uk: Оцінка URL бокса наступна. Слів пораховано: %(len)s. Час читання: ~ %(time)s хв

source: You should specify at least one of next fields: URL or/and Text box.
uk: Ви повинні визначити, принаймні, один з наступних полів: URL та/або текст бокс.

source: Reading time evaluation service of URL and/or inserted text by your own words per minute speed.
uk: Сервіс оцінки часу читання URL адреси та/або вставленого тексту зі вказанням швидкості читання слів на хвилину.

source: Get in touch
uk: Зв'язатися

source: About me
uk: Про мене

source: Version %(version)s
uk: Версія %(version)s

source: Reading time evaluation form
uk: Форма оцінки часу читання

source: or
uk: або

source: Evaluate!
uk: Оцінити!

source: Reading time evaluation service | Home page
uk: Сервіс оцінки часу читання | Домашня сторінка

source: Reading time estimation service
uk: Сервіс оцінки часу читання

source: Nowadays, we're all in a hurry, so we need to count every second of our time to enhance our performance. This service will help you evaluate approximate reading time of a given text. It works on full websites as well as plain text.
uk: Сьогодні, ми всі поспішаємо, тому нам потрібно рахувати кожну секунду нашого часу, щоб покращити продуктивність. Цей сервіс допоможе вам оцінити приблизний час читання наданого тексту. Портал працює як з веб-сайтами, так і з звичайним текстом.

source: Evaluate
uk: Оцінити

source: Pass a test
uk: Пройти тест

source: The test will help you evaluate your reading speed.
uk: Тест допоможе вам оцінити вашу швидкість читання.

source: English version only
uk: Тільки англійська версія

source: There is an option for other languages as well. You can install a browser extension called Spritzlet, open any link and try to play with the reading speed on any website. You can find more details here:
uk: Є також варіант для інших мов також. Ви можете встановити додаток для браузеру, який називається Spritzlet, відкрийте довільне посилання та спробуйте пограти зі швидкістю читання на довільній веб-сторінці. Більше деталей ви знайдете тут:

source: Spritz extension
uk: Spritz додаток

source: How does it work?
uk: Як це працює?

source: The algorithm is the following: we count all the words from a website or from the text you provide, divide the number by the reading speed (default 200 WPM) and get approximate reading time. E.g.: 2000 words / 200 WPM = 10 minutes of reading.
uk: Алгоритм роботи наступний: ми рахуємо всі слова на веб-сторінці або з тексту, який ви надасте , ділимо ці слова на швидкість читання (зазвичай 200 слів на хвилину) та отримуємо приблизний час читання. Наприклад: 2000 слів / 200 слів (швидкість читання) = 10 хвилин читання.

source: Contributions
uk: Внески

source: It is an open source project, so any contributions or ideas are welcome.
uk: Це проект з відкритим вихідним кодом, так що любі внески або ідеї вітаються.

source: Jump to Github repository
uk: Перейти до Github репозиторія
